src/corners/david/mason-chapter5.org
#+TITLE: Marx, Marxism, and Socialism

* Background
- At the same time as [[id:1a8f35a8-f6ca-4ea9-8e59-0d2a3b966ddb][1848: The People's Spring]] was happening, Marx and Engel wrote the Communist Manifesto.
  - Inspires USSR in 1917
- Both were part of a secret society called the Communist League and the manifesto was created as a pamphlet for mass distribution
- Begins with the idea that Communism was haunting Europe (in reality this was more likely to be the [[id:1a8f35a8-f6ca-4ea9-8e59-0d2a3b966ddb][The People's Spring]])
  - Emphasizes the idea of class struggle and claims all of history is rooted in it
  - Progression in a society is based in conflict between dominant and subordinate classes
  - Depicts revolution of proletariat as an invevitability and that it will head towards egalitarianism
- Waited on distribution originally, then as the conservative trend came to be he was exiled from Prussia, then France
- Only participated in revolution in the form of People's Spring.
- Supported Paris Commune, radical government which led to lots of death in Paris, due to intermediate step of 'dictatorship of the proletariat'
- Wished for something to disrupt Russian autocracy to motivate working class (didn't happen until WW1)

* Marxism
- Material focus: the /means of production/ (aka what produces things of value) is what is important
  - In feudalism land would be the means of production
  - In capitalism it would be capital
- Those who control the means of production have essentially all the power
  - This is called the bourgeoisie for capitalism, and the subordinates the proletariat
- Natural evolution: primitive-communal, slavery, feudalism, capitalism, then communism
- Capitalism is already failing: the inequity means that workers make things they cannot afford and as a result overproduction can be disastrous at times that lead to layoffs
  - More economic crises, angrier workers
  - More awareness of situation
  - Revolution
- When workers own the means of production the superstructure of human nature will change
  - No more social classes
  - No greed due to different superstructure
- No crime or government
  - Government exists only to perpetuate class dominance
  - No classes, no crime

* Legacy
- Scientific view of society with economic determinism has persisted to modern times
- Helped foster socialism in Europe
- Communism not very relevant until Russian revolutionaries
- Russia was where Marxism expanded
  - No legal parties under tsardom, all illegal and secret
  - Das Kapital was translated and got attention
  - Vladimir Lening was the leader of the Bolshevik faction
    - Bolsheviks seized power after the war in Nov 1917
    - Revised version of Marxism for Russia called Marxism-Leninism
    - Survived until 1991 collapse of USSR
    - Also very popular throughout rest of world

