docs/corners/david/mason-chapter5.tex
% Created 2021-09-24 Fri 14:01
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Marx, Marxism, and Socialism}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Marx, Marxism, and Socialism},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Background}
\label{sec:org9aecd0e}
\begin{itemize}
\item At the same time as \href{mason-chapter4.org}{1848: The People's Spring} was happening, Marx and Engel wrote the Communist Manifesto.
\begin{itemize}
\item Inspires USSR in 1917
\end{itemize}
\item Both were part of a secret society called the Communist League and the manifesto was created as a pamphlet for mass distribution
\item Begins with the idea that Communism was haunting Europe (in reality this was more likely to be the \href{mason-chapter4.org}{The People's Spring})
\begin{itemize}
\item Emphasizes the idea of class struggle and claims all of history is rooted in it
\item Progression in a society is based in conflict between dominant and subordinate classes
\item Depicts revolution of proletariat as an invevitability and that it will head towards egalitarianism
\end{itemize}
\item Waited on distribution originally, then as the conservative trend came to be he was exiled from Prussia, then France
\item Only participated in revolution in the form of People's Spring.
\item Supported Paris Commune, radical government which led to lots of death in Paris, due to intermediate step of 'dictatorship of the proletariat'
\item Wished for something to disrupt Russian autocracy to motivate working class (didn't happen until WW1)
\end{itemize}

\section{Marxism}
\label{sec:org862890d}
\begin{itemize}
\item Material focus: the \emph{means of production} (aka what produces things of value) is what is important
\begin{itemize}
\item In feudalism land would be the means of production
\item In capitalism it would be capital
\end{itemize}
\item Those who control the means of production have essentially all the power
\begin{itemize}
\item This is called the bourgeoisie for capitalism, and the subordinates the proletariat
\end{itemize}
\item Natural evolution: primitive-communal, slavery, feudalism, capitalism, then communism
\item Capitalism is already failing: the inequity means that workers make things they cannot afford and as a result overproduction can be disastrous at times that lead to layoffs
\begin{itemize}
\item More economic crises, angrier workers
\item More awareness of situation
\item Revolution
\end{itemize}
\item When workers own the means of production the superstructure of human nature will change
\begin{itemize}
\item No more social classes
\item No greed due to different superstructure
\end{itemize}
\item No crime or government
\begin{itemize}
\item Government exists only to perpetuate class dominance
\item No classes, no crime
\end{itemize}
\end{itemize}

\section{Legacy}
\label{sec:org9fce8bc}
\begin{itemize}
\item Scientific view of society with economic determinism has persisted to modern times
\item Helped foster socialism in Europe
\item Communism not very relevant until Russian revolutionaries
\item Russia was where Marxism expanded
\begin{itemize}
\item No legal parties under tsardom, all illegal and secret
\item Das Kapital was translated and got attention
\item Vladimir Lening was the leader of the Bolshevik faction
\begin{itemize}
\item Bolsheviks seized power after the war in Nov 1917
\item Revised version of Marxism for Russia called Marxism-Leninism
\item Survived until 1991 collapse of USSR
\item Also very popular throughout rest of world
\end{itemize}
\end{itemize}
\end{itemize}
\end{document}
